       IDENTIFICATION DIVISION.
       PROGRAM-ID.                PGM00003.
       AUTHOR.                    MARCUS SACRAMENTO.
       INSTALLATION.              ESTUDO COBOL.
       DATE-WRITTEN.              24/07/2019.
       DATE-COMPILED.
       SECURITY.                  PROGRAMA DE ESTUDO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.           IBM-3083.
       OBJECT-COMPUTER.           IBM-3083.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01  SYSIN-PARAMETER         PIC X(80).
       PROCEDURE DIVISION.
           DISPLAY 'INICIO DA EXECUÇÃO'.
           ACCEPT SYSIN-PARAMETER FROM SYSIN.
           DISPLAY 'SAIDA:' SYSIN-PARAMETER.
