//#JOB_NAME# JOB (COBOL),
//             '#ACCOUNT#',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1)#EXTRA_PARAMETER#
//**CP2
//COMPILA  EXEC COBOL,
//         PROG='#PROGRAM#',
//         BIBF='HERC01.PRIVLIB.SOURCE',
//         BIBC='HERC01.PRIVLIB.LOAD'
/*